---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GridNetLocationMark
source: html/f78409dd-18ea-2176-edd3-87ba98b6f862.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GridNetLocationMark Property

"Location Mark": Provides grid system association information

## Syntax (C#)
```csharp
public static ForgeTypeId GridNetLocationMark { get; }
```